Repository: AbhaiSankarPR/Sacred_Space
Catalog: lib/l10n/app_*.arb
Languages: ml

# welcomeTitle
source: Welcome to Sacred Space
ml: Sacred Space-ലേക്ക് സ്വാഗതം

# signInSubtitle
source: Sign in to access your account
ml: അക്കൗണ്ട് ആക്സസ് ചെയ്യാൻ ലോഗിൻ ചെയ്യുക

source: Church
ml: പള്ളി

# enterChurch
source: Enter church code or name
ml: പള്ളിയുടെ പേരോ കോഡോ നൽകുക

source: Email
ml: ഇമെയിൽ

# enterEmail
source: Enter your email
ml: നിങ്ങളുടെ ഇമെയിൽ നൽകുക

source: Password
ml: പാസ്‌വേഡ്

# enterPassword
source: Enter your password
ml: നിങ്ങളുടെ പാസ്‌വേഡ് നൽകുക

source: Sign In
ml: ലോഗിൻ

# noAccount
source: Don't have an account?
ml: അക്കൗണ്ട് ഇല്ലേ?

source: Sign up
ml: സൈൻ അപ്പ് ചെയ്യുക

# selectChurchError
source: Please select a church
ml: ദയവായി ഒരു പള്ളി തിരഞ്ഞെടുക്കുക

# fillFieldsError
source: Please fill all fields
ml: എല്ലാ വിവരങ്ങളും പൂരിപ്പിക്കുക

# loginFailed
source: Login failed. Please check credentials.
ml: ലോഗിൻ പരാജയപ്പെട്ടു. വിവരങ്ങൾ പരിശോധിക്കുക.

# signupTitle
source: Create Account
ml: അക്കൗണ്ട് തുടങ്ങാം

# signupSubtitle
source: Sign up to get started
ml: തുടങ്ങുന്നതിനായി സൈൻ അപ്പ് ചെയ്യുക

source: Full Name
ml: പൂർണ്ണരൂപത്തിലുള്ള പേര്

source: Confirm Password
ml: പാസ്‌വേഡ് ഉറപ്പാക്കുക

# passwordMismatch
source: Passwords do not match
ml: പാസ്‌വേഡുകൾ പൊരുത്തപ്പെടുന്നില്ല

# fillAllFields
source: Please fill all fields and select a church
ml: ദയവായി എല്ലാ വിവരങ്ങളും നൽകി പള്ളി തിരഞ്ഞെടുക്കുക

source: Signup failed
ml: സൈൻ അപ്പ് പരാജയപ്പെട്ടു

# alreadyHaveAccount
source: Already have an account?
ml: നിങ്ങൾക്ക് മുൻപേ അക്കൗണ്ട് ഉണ്ടോ?

source: Login
ml: ലോഗിൻ

source: Sign Up
ml: സൈൻ അപ്പ് ചെയ്യുക

source: Settings
ml: ക്രമീകരണങ്ങൾ

# accountSection
source: Account
ml: അക്കൗണ്ട്

# preferencesSection
source: Preferences
ml: മുൻഗണനകൾ

# supportSection
source: Support
ml: സഹായം

source: Edit Profile
ml: പ്രൊഫൈൽ തിരുത്തുക

source: Change Password
ml: പാസ്‌വേഡ് മാറ്റുക

source: Notifications
ml: അറിയിപ്പുകൾ

source: Dark Mode
ml: ഡാർക്ക് മോഡ്

source: Language
ml: ഭാഷ

source: Help & Support
ml: സഹായവും പിന്തുണയും

source: About App
ml: ആപ്പിനെക്കുറിച്ച്

# appVersion
source: Version 1.0.0 (Beta)
ml: പതിപ്പ് 1.0.0 (Beta)

# appDescription
source: Sacred Space connects you with your parish community. Stay updated with announcements, book facilities, and manage your church profile all in one place.
ml: Sacred Space നിങ്ങളെ നിങ്ങളുടെ ഇടവകയുമായി ബന്ധിപ്പിക്കുന്നു. അറിയിപ്പുകൾ അറിയാനും പള്ളിയിലെ സൗകര്യങ്ങൾ ബുക്ക് ചെയ്യാനും നിങ്ങളുടെ പ്രൊഫൈൽ നിയന്ത്രിക്കാനും ഇത് സഹായിക്കുന്നു.

source: Website
ml: വെബ്സൈറ്റ്

source: Privacy Policy
ml: സ്വകാര്യതാ നയം

source: Terms of Service
ml: ഉപയോഗ നിബന്ധനകൾ

source: Rate Us
ml: ഞങ്ങളെ വിലയിരുത്തുക

# allRightsReserved
source: Â© 2026 Sacred Space Team. All rights reserved.
ml: © 2026 Sacred Space ടീം. എല്ലാ അവകാശങ്ങളും നിക്ഷിപ്തം.

# eventsTitle
source: Church Events
ml: പരിപാടികൾ

source: Upcoming
ml: വരാനിരിക്കുന്നവ

source: My Events
ml: എന്റെ പരിപാടികൾ

source: Past
ml: കഴിഞ്ഞവ

# noEventsFound
source: No {status} events found
ml: {status} പരിപാടികളൊന്നും ലഭ്യമല്ല

source: REGISTER NOW
ml: രജിസ്റ്റർ ചെയ്യുക

source: REGISTERED - GOING
ml: രജിസ്റ്റർ ചെയ്തു

# rsvpUpdated
source: RSVP status updated!
ml: വിവരങ്ങൾ പുതുക്കി!

source: JAN
ml: ജനു

source: FEB
ml: ഫെബ്രു

source: MAR
ml: മാർച്ച്

source: APR
ml: ഏപ്രിൽ

source: MAY
ml: മേയ്

source: JUN
ml: ജൂൺ

source: JUL
ml: ജൂലൈ

source: AUG
ml: ഓഗസ്റ്റ്

source: SEP
ml: സെപ്റ്റം

source: OCT
ml: ഒക്ടോ

source: NOV
ml: നവം

source: DEC
ml: ഡിസം

source: Dashboard
ml: ഡാഷ്‌ബോർഡ്

source: Bookings
ml: ബുക്കിംഗുകൾ

source: Announcements
ml: അറിയിപ്പുകൾ

source: Events
ml: പരിപാടികൾ

source: Gallery
ml: ഗാലറി

source: Emergency Alerts
ml: അടിയന്തര അറിയിപ്പുകൾ

source: Profile
ml: പ്രൊഫൈൽ

source: Sign Out
ml: പുറത്തിറങ്ങുക

source: Member Dashboard
ml: മെമ്പർ ഡാഷ്‌ബോർഡ്

# accessType
source: {role} ACCESS
ml: {role} ആക്സസ്

source: My Profile
ml: എന്റെ പ്രൊഫൈൽ

source: Emergency
ml: അടിയന്തരം

source: Support
ml: പിന്തുണ

source: REPORT SOS
ml: SOS റിപ്പോർട്ട് ചെയ്യുക

source: Active Alerts
ml: നിലവിലെ അറിയിപ്പുകൾ

source: Recent History
ml: കഴിഞ്ഞകാല വിവരങ്ങൾ

source: Confirm SOS
ml: SOS സ്ഥിരീകരിക്കുക

# sosDialogBody
source: Are you sure you want to broadcast an emergency signal to all admins? This should only be used for serious situations.
ml: നിങ്ങൾ എല്ലാ അഡ്മിൻമാർക്കും ഒരു അടിയന്തര സിഗ്നൽ അയക്കാൻ ആഗ്രഹിക്കുന്നുണ്ടോ? ഗൗരവകരമായ സാഹചര്യങ്ങളിൽ മാത്രം ഇത് ഉപയോഗിക്കുക.

source: Cancel
ml: ഒഴിവാക്കുക

source: SEND ALERT
ml: അലർട്ട് അയക്കുക

# sosSent
source: SOS Signal Sent! Admins notified.
ml: SOS സിഗ്നൽ അയച്ചു! അഡ്മിൻമാരെ വിവരമറിയിച്ചു.

# heavyRainTitle
source: Heavy Rain Warning
ml: കനത്ത മഴ മുന്നറിയിപ്പ്

# heavyRainDesc
source: Severe flooding expected in lower parking areas. Please move vehicles immediately.
ml: താഴ്ന്ന പാർക്കിംഗ് ഏരിയകളിൽ വെള്ളപ്പൊക്കത്തിന് സാധ്യതയുണ്ട്. വാഹനങ്ങൾ ഉടൻ മാറ്റുക.

# fireDrillTitle
source: Fire Drill Completed
ml: ഫയർ ഡ്രിൽ പൂർത്തിയായി

# fireDrillDesc
source: The scheduled fire drill for the north wing has been successfully completed.
ml: നോർത്ത് വിംഗിലെ ഫയർ ഡ്രിൽ വിജയകരമായി പൂർത്തിയാക്കി.

# powerMainTitle
source: Power Maintenance
ml: വൈദ്യുതി അറ്റകുറ്റപ്പണി

# powerMainDesc
source: Main hall power was restored at 4:00 PM.
ml: മെയിൻ ഹാളിലെ വൈദ്യുതി വൈകുന്നേരം 4:00 മണിക്ക് പുനഃസ്ഥാപിച്ചു.

# minsAgo
source: {count} mins ago
ml: {count} മിനിറ്റ് മുൻപ്

# daysAgo
source: {count} days ago
ml: {count} ദിവസം മുൻപ്

source: Edit Profile coming soon!
ml: പ്രൊഫൈൽ തിരുത്താനുള്ള സൗകര്യം ഉടൻ ലഭ്യമാകും!

source: Personal Information
ml: വ്യക്തിഗത വിവരങ്ങൾ

source: Notification Preferences
ml: അറിയിപ്പ് ക്രമീകരണങ്ങൾ

source: About Us
ml: ഞങ്ങളെക്കുറിച്ച്

source: ACCOUNT SETTINGS
ml: അക്കൗണ്ട് ക്രമീകരണങ്ങൾ

source: APP INFO
ml: ആപ്പ് വിവരങ്ങൾ

source: Log Out
ml: പുറത്തിറങ്ങുക

source: My Bookings
ml: എന്റെ ബുക്കിംഗുകൾ

source: New Booking
ml: പുതിയ ബുക്കിംഗ്

source: All
ml: എല്ലാം

source: Pending
ml: തീരുമാനമാകാത്തവ

source: Approved
ml: അംഗീകരിച്ചവ

source: Rejected
ml: നിരസിച്ചവ

source: No bookings found
ml: ബുക്കിംഗുകളൊന്നും ലഭ്യമല്ല

source: Cancel Request
ml: അപേക്ഷ റദ്ദാക്കുക

source: Marriage Ceremony
ml: വിവാഹ ചടങ്ങ്

source: Prayer Hall Request
ml: പ്രാർത്ഥനാ ഹാൾ അപേക്ഷ

source: Youth Meeting
ml: യുവജന സമ്മേളനം

source: New Request
ml: പുതിയ അപേക്ഷ

source: Booking Details
ml: വിവരങ്ങൾ

source: Event Type
ml: പരിപാടിയുടെ തരം

source: Select event type
ml: പരിപാടി തിരഞ്ഞെടുക്കുക

source: Date
ml: തീയതി

source: Select Date
ml: തീയതി തിരഞ്ഞെടുക്കുക

source: Time
ml: സമയം

source: Select Time
ml: സമയം തിരഞ്ഞെടുക്കുക

source: Purpose / Notes
ml: ലക്ഷ്യം / കുറിപ്പുകൾ

# describeEvent
source: Describe your event briefly...
ml: ചുരുക്കത്തിൽ വിവരിക്കുക...

source: Submit Request
ml: അപേക്ഷ സമർപ്പിക്കുക

# pleaseSelectDateTime
source: Please select a date and time
ml: തീയതിയും സമയവും തിരഞ്ഞെടുക്കുക

source: Request Sent!
ml: അപേക്ഷ അയച്ചു!

# bookingSuccessMessage
source: Your booking request has been submitted to the admin. You will receive a notification once it is approved.
ml: നിങ്ങളുടെ ബുക്കിംഗ് അപേക്ഷ അഡ്മിന് സമർപ്പിച്ചു. അപേക്ഷ അംഗീകരിച്ചാലുടൻ നിങ്ങൾക്ക് അറിയിപ്പ് ലഭിക്കും.

source: OK
ml: ശരി

source: Baptism
ml: മാമോദീസ

# prayerMeeting
source: Prayer Hall Meeting
ml: പ്രാർത്ഥനാ യോഗം

# counseling
source: Counseling Session
ml: കൗൺസിലിംഗ്

# communityEvent
source: Community Hall Event
ml: കമ്മ്യൂണിറ്റി ഹാൾ പരിപാടി

source: Other
ml: മറ്റുള്ളവ

# fieldRequired
source: Please enter a description
ml: ഈ ഫീൽഡ് നിർബന്ധമാണ്

# typeRequired
source: Please select a type
ml: അപേക്ഷയുടെ തരം തിരഞ്ഞെടുക്കുക

source: Media Gallery
ml: മീഡിയ ഗാലറി

source: Worship
ml: ആരാധന

source: Community
ml: കൂട്ടായ്മ

source: Sunday Service
ml: ഞായറാഴ്ച കുർബാന

source: River Retreat
ml: റിവർ റിട്രീറ്റ്

source: Pet Show
ml: പെറ്റ് ഷോ

source: Evening Prayer
ml: സന്ധ്യാപ്രാർത്ഥന

source: Music Concert
ml: സംഗീത നിശ

source: Coffee Hour
ml: കോഫി അവർ

# howCanWeHelp
source: How can we help you?
ml: ഞങ്ങൾ എങ്ങനെയാണ് നിങ്ങളെ സഹായിക്കേണ്ടത്?

# selectOptionBrowse
source: Select an option below or browse our FAQs
ml: താഴെയുള്ള ഓപ്ഷനുകൾ തിരഞ്ഞെടുക്കുക അല്ലെങ്കിൽ സംശയങ്ങൾ പരിശോധിക്കുക

source: Call Us
ml: വിളിക്കുക

# faqs
source: Frequently Asked Questions
ml: പതിവായുള്ള ചോദ്യങ്ങൾ (FAQs)

# sendUsMessage
source: Send us a Message
ml: ഞങ്ങൾക്ക് സന്ദേശം അയക്കുക

# feedbackHint
source: Describe your issue or feedback...
ml: നിങ്ങളുടെ പരാതിയോ അഭിപ്രായമോ ഇവിടെ രേഖപ്പെടുത്തുക...

source: Submit Feedback
ml: സമർപ്പിക്കുക

# feedbackSuccess
source: Feedback sent successfully!
ml: അഭിപ്രായം വിജയകരമായി സമർപ്പിച്ചു!

# faqQ1
source: How do I book a facility?
ml: എങ്ങനെയാണ് ഒരു സൗകര്യം ബുക്ക് ചെയ്യുന്നത്?

# faqA1
source: Go to the 'Bookings' tab in the dashboard, click 'New Booking', select your event type, date, and time, and submit your request.
ml: ഡാഷ്‌ബോർഡിലെ 'ബുക്കിംഗുകൾ' ടാബിൽ പോയി 'പുതിയ ബുക്കിംഗ്' ക്ലിക്ക് ചെയ്യുക. തീയതിയും സമയവും നൽകി അപേക്ഷ സമർപ്പിക്കാം.

# faqQ2
source: Can I edit my profile?
ml: എനിക്ക് പ്രൊഫൈൽ തിരുത്താൻ സാധിക്കുമോ?

# faqA2
source: Yes, go to the 'Profile' tab. Currently, you can view your details. Editing capability will be enabled in the next update.
ml: നിലവിൽ നിങ്ങൾക്ക് വിവരങ്ങൾ കാണാൻ മാത്രമേ സാധിക്കൂ. അടുത്ത അപ്‌ഡേറ്റിൽ തിരുത്താനുള്ള സൗകര്യം ലഭ്യമാകും.

# faqQ3
source: How do I reset my password?
ml: എങ്ങനെയാണ് പാസ്‌വേഡ് മാറ്റുന്നത്?

# faqA3
source: You can reset your password from the 'Settings' menu under 'Account', or use the 'Forgot Password' link on the login screen.
ml: 'സെറ്റിംഗ്‌സിലെ' 'അക്കൗണ്ട്' മെനുവിൽ നിന്നും അല്ലെങ്കിൽ ലോഗിൻ സ്‌ക്രീനിലെ 'ഫോർഗോട്ട് പാസ്‌വേഡ്' വഴിയോ മാറ്റാവുന്നതാണ്.

# faqQ4
source: Who sees my emergency alerts?
ml: ഞാൻ അയക്കുന്ന അടിയന്തര അറിയിപ്പുകൾ ആരൊക്കെ കാണും?

# faqA4
source: Emergency alerts are broadcasted immediately to all registered Church Admins and Priests.
ml: അടിയന്തര അറിയിപ്പുകൾ ഉടൻതന്നെ ചർച്ച് അഡ്മിൻമാർക്കും പുരോഹിതന്മാർക്കും ലഭിക്കുന്നതാണ്.

# appTagline
source: Connecting Faith and Community
ml: വിശ്വാസത്തെയും സമൂഹത്തെയും ബന്ധിപ്പിക്കുന്നു
